# モジュール宣言/変数初期化
use strict;
my %cf;
#┌─────────────────────────────────
#│ Cupid Counter : init.cgi - 2011/10/04
#│ Copyright (c) KentWeb
#│ http://www.kent-web.com/
#└─────────────────────────────────
$cf{version} = 'CupidCounter v2.1';
#┌─────────────────────────────────
#│ [注意事項]
#│ 1. このスクリプトはフリーソフトです。このスクリプトを使用した
#│    いかなる損害に対して作者は一切の責任を負いません。
#│ 2. 設置に関する質問はサポート掲示板にお願いいたします。
#│    直接メールによる質問は一切お受けいたしておりません。
#└─────────────────────────────────
#
# [ タグの書き方の例 ]
#
#  総カウント数
#  <img src="http://～～/cupid.cgi">
#
#  本日・昨日のカウント数
#  <SCRIPT LANGUAGE="JavaScript" SRC="http://～～/cupid.js"></SCRIPT>
#  <SCRIPT LANGUAGE="JavaScript">
#  <!--
#  document.write("昨日：" + Y);
#  document.write("　");
#  document.write("本日：" + T);
#  // -->
#  </SCRIPT>

#===========================================================
# ■ 設定項目
#===========================================================

# 画像連結モジュール
# 0 : gifcat.pl
# 1 : Image-Magick（サーバにインストールされている必要あり）
$cf{image_pm} = 0;

# ログファイル【サーバパス】
$cf{logfile} = './cupid.js';

# GIF画像ディレクトリ【サーバパス】
$cf{gifdir} = './gif';

# GIFカウンタの桁数
$cf{digit} = 6;

# 二重カウント防止機能 (0=no 1=yes)
# → 直前のIPアドレスをチェックし同一のIPであればカウントしない
$cf{ip_chk} = 0;

# gifcat.plのパス【サーバパス】
$cf{gifcat_pl} = './lib/gifcat.pl';

# magick.plのパス【サーバパス】
$cf{magick_pl} = './lib/magick.pl';

#===========================================================
# ■ 設定完了
#===========================================================

# 設定値を返す
sub init {
	return %cf;
}



1;

